# Pandas:

- Pandas is a Python library which is used for working with data sets.

- It has functions for analyzing, cleaning, exploring, and manipulating data.

- Pandas is used to analyze data.

- install
pip install pandas

In [1]:
! pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in d:\programdata\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in d:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in d:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in d:\programdata\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in d:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

print(pd.__version__)

2.0.3

In [3]:
import pandas as pd

mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pd.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

## Pandas Series

- A Pandas Series is like a column in a table

- It is a one-dimensional array holding data of any type

In [4]:
# Create a simple Pandas Series from a list:

# If nothing else is specified, the values are labeled with their index number. 
# First value has index 0, second value has index 1 etc.

import pandas as pd

a = [1, 7, 2]

myvar = pd.Series(a)

print(myvar)

0    1
1    7
2    2
dtype: int64

In [5]:
# Create your own labels:

import pandas as pd

a = [1, 7, 2]

myvar = pd.Series(a, index = ["x", "y", "z"])

print(myvar)

x    1
y    7
z    2
dtype: int64

In [6]:
# Return the value of "y" index:

print(myvar["y"])

7

In [7]:
# Key/Value Objects as Series

# Create a simple Pandas Series from a dictionary:

import pandas as pd

calories = {"day1": 420, "day2": 380, "day3": 390}

myvar = pd.Series(calories)

print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [8]:
# Create a Series using only data from "day1" and "day2":

import pandas as pd

calories = {"day1": 420, "day2": 380, "day3": 390}

myvar = pd.Series(calories, index = ["day1", "day2"])

print(myvar)

day1    420
day2    380
dtype: int64

## DataFrames

- Data sets in Pandas are usually multi-dimensional tables, called DataFrames

- Series is like a column, a DataFrame is the whole table.

In [10]:
# Create a DataFrame from two Series:

import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data)

print(myvar)

   calories  duration
0       420        50
1       380        40
2       390        45

In [11]:
# Locate Row
# Pandas use the loc attribute to return one or more specified row(s)

print(df.loc[0])

calories    420
duration     50
Name: 0, dtype: int64

In [12]:
# Return 0 and 1 index rows:

print(df.loc[[0, 1]])

   calories  duration
0       420        50
1       380        40

### Named Indexes

- With the index argument, you can name your own indexes.

In [13]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [14]:
# Return "day2" index row:

print(df.loc["day2"])

calories    380
duration     40
Name: day2, dtype: int64

## Load Files Into a DataFrame

- CSV

- Excel

- Text File

- JSON

### Read CSV Files

- use read_csv() function

- Syntax: pd.read_csv(filepath_or_buffer, sep=’ ,’ , header=’infer’,  index_col=None, usecols=None, engine=None, skiprows=None, nrows=None) 

- Parameters: 
 1. filepath_or_buffer: Location of the csv file. It accepts any string path or URL of the file.
 2. sep: It stands for separator, default is ‘, ‘.
 3. header: It accepts int, a list of int, row numbers to use as the column names, and the start of the data. If no names are passed, i.e., header=None, then, it will display the first column as 0, the second as 1, and so on.
 4. usecols: Retrieves only selected columns from the CSV file.
 5. nrows: Number of rows to be displayed from the dataset.
 6. index_col: If None, there are no index numbers displayed along with records.  
 7. skiprows: Skips passed rows in the new data frame.

In [18]:
import pandas as pd

df = pd.read_csv('data/data.csv')

df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [20]:
import pandas as pd

df = pd.read_csv('data/data.csv',sep=',')

df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [25]:
import pandas as pd

df = pd.read_csv('data/employees.csv',sep=',')

df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EMPLOYEE_ID     50 non-null     int64
 1   FIRST_NAME      50 non-null     object
 2   LAST_NAME       50 non-null     object
 3   EMAIL           50 non-null     object
 4   PHONE_NUMBER    50 non-null     object
 5   HIRE_DATE       50 non-null     object
 6   JOB_ID          50 non-null     object
 7   SALARY          50 non-null     int64
 8   COMMISSION_PCT  50 non-null     object
 9   MANAGER_ID      50 non-null     object
 10  DEPARTMENT_ID   50 non-null     int64
dtypes: int64(3), object(8)
memory usage: 4.4+ KB

In [36]:
import pandas as pd

df = pd.read_csv('data/employees.csv',sep=',', nrows=100, index_col=["EMPLOYEE_ID"], usecols=["EMPLOYEE_ID", "FIRST_NAME", "LAST_NAME", "HIRE_DATE"])

df.head()

            FIRST_NAME  LAST_NAME  HIRE_DATE
EMPLOYEE_ID
198             Donald   OConnell  21-JUN-07
199            Douglas      Grant  13-JAN-08
200           Jennifer     Whalen  17-SEP-03
201            Michael  Hartstein  17-FEB-04
202                Pat        Fay  17-AUG-05

In [37]:
# saving the dataframe into csv

df.to_csv('data/employees_new.csv')

### Read and Write Excel File

In [40]:
import pandas as pd

df = pd.read_excel('data/employees.xlsx', index_col="EMPLOYEE_ID")

df.head()

,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
EMPLOYEE_ID,,,,,,,,,,
198,Donald,OConnell,DOCONNEL,650.507.9833,2007-06-21,SH_CLERK,2600,-,124,50
199,Douglas,Grant,DGRANT,650.507.9844,2008-01-13,SH_CLERK,2600,-,124,50
200,Jennifer,Whalen,JWHALEN,515.123.4444,2003-09-17,AD_ASST,4400,-,101,10
201,Michael,Hartstein,MHARTSTE,515.123.5555,2004-02-17,MK_MAN,13000,-,100,20
202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000,-,201,20

In [44]:
import pandas as pd

# Import the excel file and call it xls_file 
excel_file = pd.ExcelFile('data/employees.xlsx')

# # Load the excel_file's employees as a dataframe 
df = excel_file.parse('employees') 

df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,2007-06-21,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,2008-01-13,SH_CLERK,2600,-,124,50
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,2003-09-17,AD_ASST,4400,-,101,10
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,2004-02-17,MK_MAN,13000,-,100,20
4,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000,-,201,20